---
kind: other
id: Methods.T:Autodesk.Revit.UI.UIDocument
source: html/8f9c51b4-cf3e-afaa-eade-bd6ab683117f.htm
---
# UIDocument Methods

Verifies that the user can be prompted to place the input element type interactively.